# Unmap Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
VertexBuffer..::..Unmap Method
VertexBuffer Class See Also
---
Unmaps the buffer, so that it can be used for rendering.
**Namespace:** Autodesk.Revit.DB.DirectContext3D**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2017
# Syntax
C#
---
```text
public void Unmap()
```

Visual Basic
---
```text
Public Sub Unmap
```

Visual C++
---
```text
public:
void Unmap()
```

# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..InvalidOperationException | This VertexBuffer is not available because Revit is not currently rendering. In general, this VertexBuffer must be used in the scope of the RenderScene() callback of IDirectContext3DServer. |

# See Also
VertexBuffer Class
Autodesk.Revit.DB.DirectContext3D Namespace